[
  {
    "pregunta": "Marque la opción correcta sobre los MCV",
    "opciones": [
      "El ciclo de vida en Cascada es divisible mientras que el incremental y el evolutivo no lo son",
      "El ciclo de vida en evolutivo, al igual que el incremental, es divisible y con alcance bien definido.",
      "Todos los ciclos de vida con alcance bien definidos son divisibles.",
      "Los ciclos de vida que evolucionan a incrementos o de manera modular son fácilmente divisibles.",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Los ciclos de vida que evolucionan a incrementos o de manera modular son fácilmente divisibles."
  },
  {
    "pregunta": "En un proyecto de Software la relación gente trabajo",
    "opciones": [
      "Es una relación lineal",
      "Es una relación dependiente",
      "Es una relación independiente",
      "Es una relación no lineal",
      "Es una relación con distribución triangular",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Es una relación no lineal"
  },
  {
    "pregunta": "Como se puede modificar un elemento de configuración de una línea base establecida",
    "opciones": [
      "Mediante la autorización del manager del proyecto",
      "Mediante una sesión grupal de todo el equipo para analizar los riesgos e impactos",
      "Mediante un proceso casi informal, siempre y cuando se comunique adecuadamente",
      "Mediante un proceso formal",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Mediante un proceso formal"
  },
  {
    "pregunta": "El objetivo de una linea base es la de",
    "opciones": [
      "Impedir los cambios que generen un impacto desmesurado dentro del proyecto",
      "Controlar los cambios sin impedir aquellos que estan debidamente justificados",
      "Controlar los cambios a efectos de mantener el alcance dentro de los acordado en el plan de gestión",
      "Gestionar los elementos de configuración producidos durante la vida del proyecto",
      "Todas las anteriores son correctas",
      "Ninguna de las anteriores es correcta"
    ],
    "respuesta_correcta": "Controlar los cambios sin impedir aquellos que estan debidamente justificados"
  },
  {
    "pregunta": "Las actividades de Gestión de Riesgos pertenecen a:",
    "opciones": ["Procesos orientados al desarrollo de software"],
    "respuesta_correcta": "Procesos orientados al desarrollo de software"
  },
  {
    "pregunta": "La sprint Review es la reunión en la cual participan el equipo de Scrum y el Product Owner, siendo la participación del Scrum Master opcional, donde se evalúa el 'QUE' se hizo en el sprint mediante una demo al cliente.",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Falso"
  },

  {
    "pregunta": "Las actividades de la gestión de configuración son",
    "opciones": [
      "Identificación, control de cambios y versiones, implementación y supervision, generación de informes de estado",
      "Identificación, control de cambios y versiones, análisis y evaluación de impactos, generación de informes de estado",
      "Revisión, control de cambios y versiones, gestión de elementos de configuración, generación de informes de estado",
      "Identificación, gestión de elementos de configuración, auditoria de la configuración, comunicación efectiva",
      "Identificación, control de cambios y versiones, auditoria de la configuración, generación de informes de estado",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Identificación, control de cambios y versiones, auditoria de la configuración, generación de informes de estado"
  },

  {
    "pregunta": "Las razones por la que medimos y posteriormente utilizamos métricas son",
    "opciones": [
      "Caracterizar, evaluar, predecir y mejorar",
      "Estimar, recopilar, evaluar y mejorar",
      "Predecir, evaluar, supervisar y mejorar",
      "Identificar, analizar, medir y mejorar",
      "Cuantificar, analizar, evaluar y mejorar",
      "Ninguna"
    ],
    "respuesta_correcta": "Caracterizar, evaluar, predecir y mejorar"
  },

  {
    "pregunta": "Una métrica es ",
    "opciones": [
      "Acción o acto de medir",
      "Proceso mediante el cual se asignan número o símbolos a los atributos de las entidades del mundo real",
      "Proporciona un indicio cuantitativo de la extensión, cantidad, dimensión, capacidad o tamaño de algún atributo de un producto o proceso",
      "Medida cuantitativa del grado en el que un sistema, componente o proceso posee un atributo determinado.",
      "Permite a los gerentes de los proyectos aplicar ajustes para hacer las cosas mejor.",
      "Conjunto de métricas que proporcionan comprensión acerca del proceso, proyecto o producto software."
    ],
    "respuesta_correcta": "Medida cuantitativa del grado en el que un sistema, componente o proceso posee un atributo determinado."
  },

  {
    "pregunta": "Las diferencias entre medición, medida, métrica e indicador son las siguientes",
    "opciones": [
      "Medición es el acto de determinar una medida, la cual mediante la aplicación de algún cálculo se transforma en una métrica que proporciona una indicación cuantitativa de algún atributo y un conjunto de métricas nos da un indicador.",
      "Medición es el acto de medir del cual se obtiene una métrica, la cual mediante la aplicación de algún cálculo se transforma en una medida y un conjunto de medidas nos da un indicador.",
      "Medición es el acto de determinar una métrica, la cual mediante la aplicación de algún calculo se transforma en una medida que proporciona una indicación cuantitativa de algún atributo y un conjunto de métricas y medidas nos da un indicador.",
      "Hay dos más y paja de escribir",
      "Ninguna de las anteriores es correcta"
    ],
    "respuesta_correcta": "Medición es el acto de determinar una métrica, la cual mediante la aplicación de algún calculo se transforma en una medida que proporciona una indicación cuantitativa de algún atributo y un conjunto de métricas y medidas nos da un indicador."
  },

  {
    "pregunta": "Seleccione la opción que mas se acerque a la definición de “Reunion de Planificación” (Planning Meeting)",
    "opciones": [
      "Se realiza al inicio del proyecto y se estiman todos los PBI (Historia de usuario) para luego distribuirlos en los sprints",
      "Se realiza al inicio de cada sprint donde se define que se va a construir y como, y se define el incremento",
      "El scrum master selecciona que probables PBI (Historias de usuario) se podrían construir y valida con el equipo",
      "El product owner selecciona que probables PBI (Historias de usuario) se podrían construir y valida con el equipo.",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Se realiza al inicio de cada sprint donde se define que se va a construir y como, y se define el incremento"
  },

  {
    "pregunta": "Marque cuales son Artefactos de Scrum",
    "opciones": [
      "Product Backlog",
      "Development Backlog Item",
      "Sprint Planning",
      "Retrospective Meeting",
      "Sprint backlog",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "Product Backlog & Sprint backlog"
  },

  {
    "pregunta": "La diferencia de Fast Tracking con Crashing es:",
    "opciones": [
      "Fast Tracking es acelerar los tiempos planificados de desarrollo, mientras que Crashing es comprimir las tareas acortando su duración lo más posible",
      "Fast Tracking es agregar más recursos al camino crítico para reducir su duración, mientras que Crashing es paralelizar las tareas del camino crítico a fin de acelerar los tiempos del proyecto",
      "Fast tracking implica la paralelizacion de tarea del camino critico y crashing es ajustar o incrementar los recursos mientras se comprimen los tiempos planificados siempre manteniendo el alcance original",
      "Fast Tracking y Crashing son lo mismo depende de como lo llama una u otra bibliografía",
      "Fast Tracking es agregar mas recursos para permitir incrementar la holgura a fin de no afectar la fecha de finalización del proyecto, mientras que Crashing es paralelizar las tareas a fin de acelerar los tiempos del proyecto y reducir esa fecha",
      "Ninguna de las anteriores es correcta"
    ],
    "respuesta_correcta": "Fast tracking implica la paralelizacion de tarea del camino critico y crashing es ajustar o incrementar los recursos mientras se comprimen los tiempos planificados siempre manteniendo el alcance original"
  },

  {
    "pregunta": "Seleccione la opción mas adecuada. MS Project me permite asignar Calendarios a",
    "opciones": [
      "Solamente por proyecto",
      "Por proyecto y por recurso",
      "Solamente por recurso",
      "Ninguna de las anteriores"
    ],
    "respuesta_correcta": "Por proyecto y por recurso"
  },

  {
    "pregunta": "¿Que caracteriticas no pueden faltar para considerar un producto software de calidad?",
    "opciones": [
      "Satisfacción del usuario",
      "Cumplimiento de los requisitos",
      "Eficiencia",
      "Portabilidad",
      "Todas las anteriores son correctas",
      "Ninguna de las anteriores"
    ],
    "respuesta_correcta": "Satisfacción del usuario & Cumplimiento de los requisitos"
  },

  {
    "pregunta": "¿Qué factores de la calidad determina el “Grado en el que es posible controlar el acceso de persona no autorizadas al software o a los datos”?",
    "opciones": [
      "Corrección",
      "Confiabilidad",
      "Eficacia",
      "Integridad",
      "Usabilidad",
      "Flexibilidad"
    ],
    "respuesta_correcta": "Integridad"
  },

  {
    "pregunta": "El control de calidad afecta directamente ",
    "opciones": [
      "El producto",
      "El proceso",
      "Auditoria",
      "Integridad",
      "Todas las anteriores son correctas",
      "Ninguna es correcta"
    ],
    "respuesta_correcta": "El producto"
  },

  {
    "pregunta": "Las métricas orientadas al tamaño",
    "opciones": [
      "Son difíciles de recolectar",
      "Son independientes del leguaje de programación",
      "El esfuerzo es una métrica orientada al tamaño",
      "Los puntos de función es una métrica orientada al tamaño",
      "Todas las anteriores son correctas",
      "Ninguna de las anteriores es correcta"
    ],
    "respuesta_correcta": "Ninguna de las anteriores es correcta"
  },

  {
    "pregunta": "Son tipos de estructuras de equipo",
    "opciones": [
      "Centralizado controlado",
      "Descentralizado democrático",
      "Descentralizado controlado",
      "Descentralizado descontrolado",
      "Equipos disfuncionales",
      "Centralizado democráticion"
    ],
    "respuesta_correcta": "Centralizado controlado & Descentralizado democrático & Descentralizado controlado"
  },

  {
    "pregunta": "En un proyecto Software la relación gente trabajo",
    "opciones": [
      "Es una relación atipica",
      "Es una relación lineal",
      "Es una relación dependiente",
      "Es una relación independiente",
      "Ninguna"
    ],
    "respuesta_correcta": "Ninguna"
  },

  {
    "pregunta": "En relación con la metodología para seleccionar el MCV visto en clase, marque la opción correcta",
    "opciones": [
      "Se evaluan 20 criterios agrupados por 4 categorias",
      "Cada uno de los criterios se evalua por Bajo, Medio y Alto",
      "Para seleccionar un MCV de debe hacer el promedio del resultado de los MCV seleccionados",
      "Se puede seleccionar algunas categorias, no es obligatorio selccionar todas",
      "El valor mas alto es MCV recomendado para utilizar"
    ],
    "respuesta_correcta": "El valor mas alto es MCV recomendado para utilizar"
  },

  {
    "pregunta": "Es una forma de estimacion",
    "opciones": [
      "Juicio experto",
      "3 Valores (Pert)",
      "Paramétrica",
      "Calculo de Reversa",
      "Heurística"
    ],
    "respuesta_correcta": "Juicio experto & 3 Valores (Pert) & Paramétrica"
  },

  {
    "pregunta": "Un equipo de alto rendimiento se caracteriza por",
    "opciones": [
      "Las problemáticas deben adecuarse a las habilidades",
      "Confianza entre sus miembros",
      "Para mantener la union del equipo, los conformistas deben ser excluidos",
      "Ninguna opción es correcta"
    ],
    "respuesta_correcta": "Confianza entre sus miembros"
  },

  {
    "pregunta": "En un MCV Incremental, marque la opción correcta",
    "opciones": [
      "Se entregan funcionalidades completas en cada incremento",
      "El sistema se entrEga con funcionalidades basicas, y las mismas van evolucionado en cada entrega",
      "Ninguna",
      "Se deben tener todos los requerimientos al inicio para poder empezar"
    ],
    "respuesta_correcta": "Se entregan funcionalidades completas en cada incremento"
  },

  {
    "pregunta": "Camino crítico es *",
    "opciones": [
      "Todas son correctas",
      "Las actividades que tienen riego muy alto.",
      "Conjunto de actividades que definen la duracion del proyecto",
      "La sumatorias de las actividades que tienen Holgura igual a 1 (uno)",
      "Las actividades que de demorarse, se posterga la fecha de fin de proyecto."
    ],
    "respuesta_correcta": "Las actividades que de demorarse, se posterga la fecha de fin de proyecto."
  },

  {
    "pregunta": "Marque la opción incorrecta sobre EDT (WBS) *",
    "opciones": [
      "No define secuencia.",
      "El nivel más alto de cada división se llama paquete de trabajo",
      "Organigrama jerárquico del proyecto donde se subdivide el mismo en menores componentes",
      "Consiste en dividir en componentes menores para facilitar la planificación y control"
    ],
    "respuesta_correcta": "El nivel más alto de cada división se llama paquete de trabajo"
  },

  {
    "pregunta": "¿Qué es IEEE 1074?",
    "opciones": [
      "Un estándar para la gestión de bases de datos",
      "Un estándar para el desarrollo de hardware",
      "Un estándar para la gestión de procesos de ingeniería de sistemas",
      "Un estándar para la programación orientada a objetos"
    ],
    "respuesta_correcta": "Un estándar para la gestión de procesos de ingeniería de sistemas"
  },

  {
    "pregunta": "Caracteristica/s de los distintos tipos de recursos que se analizan en la planificación: *",
    "opciones": [
      "Soluciones o componentes en la Nube",
      "Componentes de software reutilizables",
      "Oficinas",
      "Habilidades del personal",
      "Entornos",
      "Todas las opciones"
    ],
    "respuesta_correcta": "Todas las opciones"
  },

  {
    "pregunta": "Los beneficios de descomponer el problema son: *",
    "opciones": [
      "Se puede obtener la fecha de fin de proyecto con un margen de error de +/- 5%",
      "Entender que se debe hacer y como se va a hacer",
      "Facilita la estimación",
      "Aumenta la probabilidad de éxito"
    ],
    "respuesta_correcta": "Entender que se debe hacer y como se va a hacer / Facilita la estimación / Aumenta la probabilidad de éxito"
  },

  {
    "pregunta": "Los tipos de dependencias entre tareas pueden ser",
    "opciones": [
      "Mandatorias, discrecionales, transitorias y permanentes",
      "Directas, indirectas, externas e internas",
      "Heredadas, implícitas, externas y transitorias",
      "Opcionales, discrecionales, externas e internas",
      "Mandatorias/Obligatorias, discrecionales, externas e internas"
    ],
    "respuesta_correcta": "Mandatorias/Obligatorias, discrecionales, externas e internas"
  },

  {
    "pregunta": "Cual no es una característica de los riesgos",
    "opciones": ["No podemos evitarlos"],
    "respuesta_correcta": "No podemos evitarlos"
  },

  {
    "pregunta": "Clasificación de riesgos inicial es:",
    "opciones": ["Conocidos", "Predecibles", "Impredecibles"],
    "respuesta_correcta": "Conocidos / Predecibles / Impredecibles"
  },

  {
    "pregunta": "Si digo: 'combina procedimientos y herramientas para gestionar las versiones de los objetos de configuración creados durante el proceso del software'. Estoy hablando de:",
    "opciones": [
      "Control de cambios",
      "Control de versiones",
      "Proceso de control de cambios",
      "Team Foundation Server",
      "Todas las anteriores son correctas",
      "Ninguna de las anteriores es correcta"
    ],
    "respuesta_correcta": "Control de versiones"
  },

  {
    "pregunta": "Para una exitosa gestión de Proyectos se sugiere:",
    "opciones": [
      "Hacer un buen seguimiento del progreso en todo momento",
      "Mantener y motivar al personal para evitar o minimizar la rotación",
      "No importa sino se entiende el problema, podemos arrancar y después vemos",
      "Una vez que el Proyecto finaliza archivar todo. Al pasado pisado!",
      "Evitar un análisis de riesgos ya que es muy costoso, con lo que es ahora podemos agregar más funcionalidades"
    ],
    "respuesta_correcta": "Hacer un buen seguimiento del progreso en todo momento / Mantener y motivar al personal para evitar o minimizar la rotación"
  },

  {
    "pregunta": "Marque la opción correcta sobre EDT (Estructura de desglose de trabajo) (WBS)",
    "opciones": [
      "Consiste en dividir en componentes menores para facilitar la planificación y control",
      "Organigrama jerárquico del proyecto donde se subdivide el mismo en menores componentes",
      "El nivel más alto de cada división se llama paquete de trabajo",
      "No define secuencia"
    ],
    "respuesta_correcta": "Consiste en dividir en componentes menores para facilitar la planificación y control / Organigrama jerárquico del proyecto donde se subdivide el mismo en menores componentes / No define secuencia"
  },

  {
    "pregunta": "Los procesos y actividades para la gestión de proyectos minimizan la probabilidad de fracaso garantizando el éxito del proyecto.",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Falso"
  },

  {
    "pregunta": "La selección de un ciclo de vida implica el establecimiento de un orden de ejecución de las distintas actividades, marcadas por el proceso e involucradas en el proyecto",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Verdadero"
  },

  {
    "pregunta": "Un marco de proceso me define las actividades esenciales con un propósito específico que puedo utilizar dentro del ciclo de vida del proyecto, pero no me define ni obliga a utilizar herramientas",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Verdadero"
  },

  {
    "pregunta": "Para la gestión de proyectos un proceso debe tener una salida explícita bien definida, pero puede carecer de entradas",
    "opciones": ["Falso", "Verdadero"],
    "respuesta_correcta": "Falso"
  },

  {
    "pregunta": "Descomponer el problema facilita el refinamiento y la evaluación, lo cual nos garantiza mas detalle al momento de estimar, el famoso divide y vencerás",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Verdadero"
  },

  {
    "pregunta": "Los equipos centralizados generan mas y mejores soluciones que los individuales, por lo tanto son mejores para problemas complejos",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Verdadero"
  },

  {
    "pregunta": "Existe un modelo de madurez para las personas llamado People-CMM",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Verdadero"
  },

  {
    "pregunta": "Cuando se selecciona un modelo de Proceso, se debe asegurar de implementar todos los subprocesos y realizar todas las actividades que el modelo propone.",
    "opciones": ["Verdadero", "Falso"],
    "respuesta_correcta": "Falso"
  },

  {
    "pregunta": "¿Cuál es el objetivo principal de IEEE 1074?",
    "opciones": [
      "Mejorar la velocidad de procesamiento de los sistemas",
      "Ayudar a los ingenieros de sistemas a desarrollar sistemas más eficientes, eficaces y de alta calidad",
      "Reducir los costos de hardware en proyectos de ingeniería",
      "Aumentar la seguridad en redes de computadoras"
    ],
    "respuesta_correcta": "Ayudar a los ingenieros de sistemas a desarrollar sistemas más eficientes, eficaces y de alta calidad"
  },

  {
    "pregunta": "¿Cuáles son las cuatro categorías definidas por IEEE 1074?",
    "opciones": [
      "Diseño, Implementación, Pruebas, Mantenimiento",
      "Planificación, Implementación, Evaluación, Gestión",
      "Análisis, Desarrollo, Integración, Despliegue",
      "Requisitos, Arquitectura, Codificación, Verificación"
    ],
    "respuesta_correcta": "Planificación, Implementación, Evaluación, Gestión"
  },

  {
    "pregunta": "¿Qué incluyen los procesos de planificación según IEEE 1074?",
    "opciones": [
      "Codificación y depuración del software",
      "Definición de objetivos, requisitos, planificación de recursos e identificación de riesgos",
      "Pruebas de unidad y de integración",
      "Mantenimiento y actualización del software"
    ],
    "respuesta_correcta": "Definición de objetivos, requisitos, planificación de recursos e identificación de riesgos"
  },

  {
    "pregunta": "¿Qué es la Ingeniería de Software?",
    "opciones": [
      "El diseño de hardware para computadoras",
      "La aplicación práctica del conocimiento científico en el diseño, construcción y mantenimiento de programas de computadoras",
      "La gestión de redes de computadoras",
      "El estudio de algoritmos matemáticos"
    ],
    "respuesta_correcta": "La aplicación práctica del conocimiento científico en el diseño, construcción y mantenimiento de programas de computadoras"
  },

  {
    "pregunta": "¿Cuál de las siguientes NO es una ventaja de definir un proceso de software?",
    "opciones": [
      "Mejora la coordinación y la comunicación",
      "Permite estimar costos y tiempos con mayor precisión",
      "Garantiza que no habrá errores en el software",
      "Proporciona oportunidades de aprendizaje y mejora continua"
    ],
    "respuesta_correcta": "Garantiza que no habrá errores en el software"
  },

  {
    "pregunta": "¿Qué es la 'regla 90-90' en la gestión de proyectos de software?",
    "opciones": [
      "El 90% del código se escribe en el 90% del tiempo del proyecto",
      "El primer 90% del sistema consume el 90% del tiempo y esfuerzo, y el último 10% requiere el otro 90%",
      "El 90% de los errores se encuentran en el 90% final del desarrollo",
      "El 90% del presupuesto se gasta en el 90% inicial del proyecto"
    ],
    "respuesta_correcta": "El primer 90% del sistema consume el 90% del tiempo y esfuerzo, y el último 10% requiere el otro 90%"
  },

  {
    "pregunta": "Según John Reel, ¿cuál de las siguientes NO es una señal de peligro en proyectos de software?",
    "opciones": [
      "Falta de comprensión de las necesidades del software",
      "Gestión inadecuada de cambios",
      "Fechas de entrega poco realistas",
      "Exceso de personal con habilidades adecuadas"
    ],
    "respuesta_correcta": "Exceso de personal con habilidades adecuadas"
  },

  {
    "pregunta": "¿Qué es la estimación PERT?",
    "opciones": [
      "Una técnica para estimar el costo total del proyecto",
      "Un método para calcular el número de líneas de código",
      "Una técnica probabilística para estimar la duración de las actividades",
      "Un sistema para medir la productividad del equipo de desarrollo"
    ],
    "respuesta_correcta": "Una técnica probabilística para estimar la duración de las actividades"
  },

  {
    "pregunta": "¿Cuál es la diferencia entre la Fecha Resultante y la Fecha Estipulada en la planificación de proyectos?",
    "opciones": [
      "La Fecha Resultante se estima hacia adelante, la Fecha Estipulada se estima hacia atrás",
      "La Fecha Resultante es impuesta por el cliente, la Fecha Estipulada es calculada por el equipo",
      "La Fecha Resultante es para proyectos pequeños, la Fecha Estipulada para proyectos grandes",
      "No hay diferencia, son términos intercambiables"
    ],
    "respuesta_correcta": "La Fecha Resultante se estima hacia adelante, la Fecha Estipulada se estima hacia atrás"
  },

  {
    "pregunta": "¿Qué es la descomposición en la estimación de proyectos de software?",
    "opciones": [
      "La división del equipo en grupos más pequeños",
      "La separación del hardware y el software",
      "La división del proyecto en elementos más manejables para su estimación",
      "La eliminación de funcionalidades no esenciales"
    ],
    "respuesta_correcta": "La división del proyecto en elementos más manejables para su estimación"
  },

  {
    "pregunta": "¿Cuál de los siguientes NO es un tipo de estimación mencionado en el texto?",
    "opciones": [
      "Estimación basada en el problema",
      "Estimación basada en el proceso",
      "Estimación basada en casos de uso",
      "Estimación basada en el cliente"
    ],
    "respuesta_correcta": "Estimación basada en el cliente"
  },

  {
    "pregunta": "¿Qué es la gestión del riesgo en la ingeniería de software?",
    "opciones": [
      "La eliminación completa de todos los riesgos posibles",
      "La identificación y manejo de los posibles riesgos que pueden afectar el éxito de un proyecto",
      "La contratación de seguros para cubrir posibles pérdidas",
      "La asignación de toda la responsabilidad al cliente"
    ],
    "respuesta_correcta": "La identificación y manejo de los posibles riesgos que pueden afectar el éxito de un proyecto"
  },

  {
    "pregunta": "¿Cuál es la diferencia principal entre las estrategias reactivas y proactivas de gestión de riesgos?",
    "opciones": [
      "Las reactivas son más efectivas que las proactivas",
      "Las proactivas se implementan después de que ocurren los problemas",
      "Las reactivas abordan los problemas una vez que han ocurrido, las proactivas buscan prevenirlos",
      "No hay diferencia significativa entre ambas estrategias"
    ],
    "respuesta_correcta": "Las reactivas abordan los problemas una vez que han ocurrido, las proactivas buscan prevenirlos"
  },

  {
    "pregunta": "¿Qué es el proceso de post-desarrollo en ingeniería de software?",
    "opciones": [
      "El proceso de pruebas del software",
      "Las actividades realizadas después de la construcción del software, incluyendo instalación, operación, soporte, mantenimiento y retiro",
      "La fase de diseño del software",
      "El proceso de documentación del código"
    ],
    "respuesta_correcta": "Las actividades realizadas después de la construcción del software, incluyendo instalación, operación, soporte, mantenimiento y retiro"
  },

  {
    "pregunta": "¿Cuál es el propósito principal de la gestión de la configuración del software?",
    "opciones": [
      "Aumentar la velocidad de desarrollo del software",
      "Reducir los costos del proyecto",
      "Gestionar los cambios a lo largo del ciclo de vida del software",
      "Mejorar la interfaz de usuario del software"
    ],
    "respuesta_correcta": "Gestionar los cambios a lo largo del ciclo de vida del software"
  },

  {
    "pregunta": "En el contexto de la ingeniería de software, ¿qué es un prototipo desechable?",
    "opciones": [
      "Un software que se usa solo una vez",
      "Una versión del software que se descarta después de las pruebas",
      "Una implementación parcial utilizada para identificar los requisitos del sistema y luego desechada",
      "Un modelo de hardware que se usa para probar el software"
    ],
    "respuesta_correcta": "Una implementación parcial utilizada para identificar los requisitos del sistema y luego desechada"
  },

  {
    "pregunta": "¿Qué caracteriza al modelo en espiral en el desarrollo de software?",
    "opciones": [
      "Es un enfoque lineal y secuencial",
      "Se basa en el análisis de riesgos y la estructuración del proceso en ciclos iterativos",
      "No permite cambios una vez que se ha iniciado el desarrollo",
      "Se enfoca exclusivamente en la fase de codificación"
    ],
    "respuesta_correcta": "Se basa en el análisis de riesgos y la estructuración del proceso en ciclos iterativos"
  },

  {
    "pregunta": "¿Qué es el Desarrollo Rápido de Aplicaciones (DRA)?",
    "opciones": [
      "Un modelo de proceso de desarrollo de software lineal secuencial enfocado en ciclos de desarrollo cortos",
      "Una técnica para escribir código más rápidamente",
      "Un método para reducir el tiempo de pruebas del software",
      "Una estrategia para eliminar la fase de diseño en el desarrollo de software"
    ],
    "respuesta_correcta": "Un modelo de proceso de desarrollo de software lineal secuencial enfocado en ciclos de desarrollo cortos"
  },

  {
    "pregunta": "En el enfoque de los '4P' del proceso de software, ¿qué representa la 'P' de 'Proceso'?",
    "opciones": [
      "Programación",
      "Pruebas",
      "La serie de pasos y actividades para definir, diseñar, desarrollar, implementar y mantener un software",
      "Presupuesto"
    ],
    "respuesta_correcta": "La serie de pasos y actividades para definir, diseñar, desarrollar, implementar y mantener un software"
  },

  {
    "pregunta": "¿Cuál es uno de los principales objetivos de la descomposición del problema en la gestión de proyectos de software?",
    "opciones": [
      "Aumentar la complejidad del proyecto",
      "Dividir un problema complejo en problemas más pequeños y manejables",
      "Eliminar la necesidad de documentación",
      "Reducir el número de desarrolladores necesarios"
    ],
    "respuesta_correcta": "Dividir un problema complejo en problemas más pequeños y manejables"
  },

  {
    "pregunta": "¿Qué es un 'gestor de proyecto' en el contexto de la ingeniería de software?",
    "opciones": [
      "Una herramienta de software para la gestión de tareas",
      "Una persona que se encarga de gestionar un proyecto desde la fase inicial hasta la final",
      "Un sistema automatizado de asignación de recursos",
      "Un consultor externo que solo supervisa el proyecto"
    ],
    "respuesta_correcta": "Una persona que se encarga de gestionar un proyecto desde la fase inicial hasta la final"
  },

  {
    "pregunta": "¿Cuál de los siguientes NO es un tipo de organigrama mencionado en los apuntes para equipos de software?",
    "opciones": [
      "Descentralizado democrático",
      "Descentralizado controlado",
      "Centralizado controlado",
      "Centralizado democrático"
    ],
    "respuesta_correcta": "Centralizado democrático"
  },

  {
    "pregunta": "¿Qué es la 'estimación paramétrica' en la gestión de proyectos de software?",
    "opciones": [
      "Una técnica que utiliza parámetros físicos del hardware",
      "Un método que usa métricas basadas en proyectos anteriores para estimar nuevos proyectos",
      "Una estimación basada únicamente en la opinión de expertos",
      "Un enfoque que solo considera el número de líneas de código"
    ],
    "respuesta_correcta": "Un método que usa métricas basadas en proyectos anteriores para estimar nuevos proyectos"
  },

  {
    "pregunta": "¿Qué representa la sigla COCOMO en el contexto de la estimación de proyectos de software?",
    "opciones": [
      "Código Complejo de Modelado",
      "Construcción de Componentes Modulares",
      "Modelo Constructivo de Costes",
      "Control de Calidad de Módulos"
    ],
    "respuesta_correcta": "Modelo Constructivo de Costes"
  },

  {
    "pregunta": "¿Cuál es la principal ventaja de utilizar una Estructura de Desglose de Trabajo (EDT/WBS) en la planificación de proyectos?",
    "opciones": [
      "Garantiza que el proyecto se complete antes de tiempo",
      "Elimina la necesidad de estimación de costos",
      "Facilita la planificación y el control al subdividir el proyecto en componentes manejables",
      "Automatiza completamente el proceso de desarrollo"
    ],
    "respuesta_correcta": "Facilita la planificación y el control al subdividir el proyecto en componentes manejables"
  },

  {
    "pregunta": "¿Qué es el 'Fast Tracking' en la gestión de proyectos de software?",
    "opciones": [
      "Una técnica para escribir código más rápidamente",
      "Un método para reducir el tiempo de pruebas",
      "Realizar actividades en paralelo que normalmente se harían en secuencia",
      "Contratar más desarrolladores para acelerar el proyecto"
    ],
    "respuesta_correcta": "Realizar actividades en paralelo que normalmente se harían en secuencia"
  },

  {
    "pregunta": "¿Cuál es el propósito principal de un Plan RSGR en la gestión de riesgos de software?",
    "opciones": [
      "Aumentar los riesgos del proyecto",
      "Documentar los pasos y estrategias para manejar los riesgos identificados",
      "Eliminar completamente todos los riesgos posibles",
      "Justificar el aumento del presupuesto del proyecto"
    ],
    "respuesta_correcta": "Documentar los pasos y estrategias para manejar los riesgos identificados"
  },

  {
    "pregunta": "¿Qué significa la técnica de estimación PERT?",
    "opciones": [
      "Proceso de Estimación Rápida de Tareas",
      "Programa de Evaluación y Revisión Técnica",
      "Plan Estratégico de Recursos Tecnológicos",
      "Proyección Estadística de Resultados Temporales"
    ],
    "respuesta_correcta": "Programa de Evaluación y Revisión Técnica"
  },

  {
    "pregunta": "En el contexto de la gestión de riesgos, ¿qué es un 'riesgo conocido'?",
    "opciones": [
      "Un riesgo que solo conoce el gerente del proyecto",
      "Un riesgo que se puede identificar mediante una evaluación cuidadosa del plan del proyecto y el entorno",
      "Un riesgo que ha ocurrido en todos los proyectos anteriores",
      "Un riesgo que no se puede mitigar"
    ],
    "respuesta_correcta": "Un riesgo que se puede identificar mediante una evaluación cuidadosa del plan del proyecto y el entorno"
  },

  {
    "pregunta": "¿Cuál es la diferencia entre los riesgos del proyecto y los riesgos técnicos en el desarrollo de software?",
    "opciones": [
      "Los riesgos del proyecto afectan la planificación y los costos, los riesgos técnicos afectan la calidad y la planificación del software",
      "Los riesgos del proyecto solo afectan al equipo de desarrollo, los riesgos técnicos afectan al cliente",
      "Los riesgos del proyecto son predecibles, los riesgos técnicos son siempre impredecibles",
      "No hay diferencia, son términos intercambiables"
    ],
    "respuesta_correcta": "Los riesgos del proyecto afectan la planificación y los costos, los riesgos técnicos afectan la calidad y la planificación del software"
  },

  {
    "pregunta": "¿Cuál es el propósito principal de la evaluación de viabilidad en la planificación de proyectos de software?",
    "opciones": [
      "Determinar el salario de los desarrolladores",
      "Elegir el lenguaje de programación a utilizar",
      "Validar el ámbito del proyecto en términos de dimensiones tecnológicas, financiamiento, tiempo y recursos disponibles",
      "Decidir el nombre del producto final"
    ],
    "respuesta_correcta": "Validar el ámbito del proyecto en términos de dimensiones tecnológicas, financiamiento, tiempo y recursos disponibles"
  },

  {
    "pregunta": "¿Cuál es la ventaja principal del modelo en espiral para el desarrollo de software?",
    "opciones": [
      "No permite cambios después de la fase de diseño",
      "Se basa en ciclos iterativos y análisis de riesgos",
      "Reduce la necesidad de pruebas de integración",
      "Es un modelo secuencial sin retroalimentación"
    ],
    "respuesta_correcta": "Se basa en ciclos iterativos y análisis de riesgos"
  },

  {
    "pregunta": "En la gestión de proyectos, ¿qué tipo de dependencia se establece por elección del equipo de gestión?",
    "opciones": ["Externa", "Interna", "Discrecional", "Obligatoria"],
    "respuesta_correcta": "Discrecional"
  },

  {
    "pregunta": "¿Qué es un 'riesgo conocido' en la gestión de riesgos de software?",
    "opciones": [
      "Un riesgo imposible de mitigar",
      "Un riesgo que ha sido identificado mediante evaluación del plan y entorno",
      "Un riesgo relacionado exclusivamente con el cliente",
      "Un riesgo que ocurre en todos los proyectos de software"
    ],
    "respuesta_correcta": "Un riesgo que ha sido identificado mediante evaluación del plan y entorno"
  },

  {
    "pregunta": "¿Cuál es el principal desafío en la estimación de proyectos de software?",
    "opciones": [
      "Falta de herramientas automáticas",
      "La incertidumbre y las variables técnicas, humanas y políticas",
      "La falta de experiencia en el equipo",
      "La cantidad de personal disponible"
    ],
    "respuesta_correcta": "La incertidumbre y las variables técnicas, humanas y políticas"
  },

  {
    "pregunta": "¿Qué técnica permite dividir un proyecto en componentes manejables y jerarquizados?",
    "opciones": [
      "Análisis de riesgos",
      "Estimación por Puntos de Función",
      "Estructura de Desglose de Trabajo (WBS)",
      "Juicio experto"
    ],
    "respuesta_correcta": "Estructura de Desglose de Trabajo (WBS)"
  },

  {
    "pregunta": "¿Qué modelo de desarrollo combina elementos del modelo cascada con la filosofía de prototipado?",
    "opciones": [
      "Modelo en espiral",
      "Modelo incremental",
      "Modelo iterativo",
      "Modelo en V"
    ],
    "respuesta_correcta": "Modelo en espiral"
  },

  {
    "pregunta": "¿Cuál es el objetivo principal del modelo en cascada?",
    "opciones": [
      "Desarrollar el software de manera iterativa",
      "Asegurar que todas las fases del desarrollo se completen en secuencia",
      "Minimizar el riesgo mediante el prototipado",
      "Utilizar una estructura de control centralizada"
    ],
    "respuesta_correcta": "Asegurar que todas las fases del desarrollo se completen en secuencia"
  },

  {
    "pregunta": "¿Cuál de las siguientes afirmaciones es correcta sobre el modelo en V?",
    "opciones": [
      "No permite retroceder a fases anteriores",
      "Se enfoca en la verificación del diseño y la validación de los requisitos",
      "Es un modelo puramente secuencial sin pruebas intermedias",
      "Es una versión del modelo en cascada que elimina la fase de pruebas"
    ],
    "respuesta_correcta": "Se enfoca en la verificación del diseño y la validación de los requisitos"
  },

  {
    "pregunta": "¿Qué es el prototipo evolutivo en el desarrollo de software?",
    "opciones": [
      "Un modelo descartable usado solo para identificar requisitos",
      "Una maqueta que muestra visualmente las entradas y salidas del sistema",
      "Un prototipo que se mejora y modifica continuamente hasta convertirse en el sistema final",
      "Un prototipo estático que no recibe datos reales"
    ],
    "respuesta_correcta": "Un prototipo que se mejora y modifica continuamente hasta convertirse en el sistema final"
  },

  {
    "pregunta": "¿Qué enfoque permite mejorar un software continuamente mientras se entrega funcionalidad en cada iteración?",
    "opciones": [
      "Modelo en cascada",
      "Modelo incremental",
      "Modelo iterativo",
      "Modelo en espiral"
    ],
    "respuesta_correcta": "Modelo incremental"
  },

  {
    "pregunta": "¿Qué técnica permite calcular el costo y esfuerzo de un proyecto mediante una estructura jerárquica que descompone sus fases?",
    "opciones": [
      "Estimación por Puntos de Función",
      "Estimación COCOMO",
      "Estimación por LDC",
      "Estimación PERT"
    ],
    "respuesta_correcta": "Estimación COCOMO"
  },

  {
    "pregunta": "¿Qué elemento clave se debe considerar al seleccionar un ciclo de vida de software?",
    "opciones": [
      "El nivel de satisfacción del cliente",
      "La naturaleza del proyecto y los requisitos",
      "La cantidad de personal disponible",
      "La experiencia previa del equipo"
    ],
    "respuesta_correcta": "La naturaleza del proyecto y los requisitos"
  },

  {
    "pregunta": "En el enfoque de 4P, ¿qué representa la P de Producto?",
    "opciones": [
      "La calidad del código",
      "El software que se va a desarrollar y los objetivos de información",
      "El presupuesto asignado al proyecto",
      "Los plazos de entrega del software"
    ],
    "respuesta_correcta": "El software que se va a desarrollar y los objetivos de información"
  },

  {
    "pregunta": "¿Cuál es una de las estrategias reactivas en la gestión de riesgos en software?",
    "opciones": [
      "Identificar y planificar la gestión de riesgos antes de que ocurran",
      "Resolver los problemas una vez que ya han sucedido",
      "Evitar tomar riesgos en absoluto",
      "Utilizar modelos probabilísticos para prever riesgos"
    ],
    "respuesta_correcta": "Resolver los problemas una vez que ya han sucedido"
  },

  {
    "pregunta": "¿Qué técnica permite determinar la probabilidad de ocurrencia de un riesgo en un proyecto de software?",
    "opciones": [
      "Análisis de la configuración",
      "Escalas cualitativas como improbable, probable, frecuente",
      "Estimación por puntos de función",
      "Juicio experto basado en proyectos similares"
    ],
    "respuesta_correcta": "Escalas cualitativas como improbable, probable, frecuente"
  },

  {
    "pregunta": "¿Qué tipo de riesgo afecta la calidad del software durante su desarrollo?",
    "opciones": [
      "Riesgo técnico",
      "Riesgo del cliente",
      "Riesgo predecible",
      "Riesgo interno"
    ],
    "respuesta_correcta": "Riesgo técnico"
  },

  {
    "pregunta": "¿Qué herramienta de gestión permite identificar las tareas críticas en la planificación de un proyecto de software?",
    "opciones": [
      "Estimación PERT",
      "Diagrama de Gantt",
      "Estructura de Desglose de Trabajo (WBS)",
      "Estimación COCOMO"
    ],
    "respuesta_correcta": "Estimación PERT"
  },

  {
    "pregunta": "¿Qué implica la técnica de 'crashing' en la gestión de proyectos de software?",
    "opciones": [
      "Aumentar los recursos en las tareas críticas para reducir su duración",
      "Dividir el proyecto en fases iterativas",
      "Desarrollar prototipos evolutivos para acelerar el desarrollo",
      "Reducir la cantidad de personal para tareas menos importantes"
    ],
    "respuesta_correcta": "Aumentar los recursos en las tareas críticas para reducir su duración"
  },

  {
    "pregunta": "¿Cuál es el propósito de la Gestión de la Configuración del Software?",
    "opciones": [
      "Asegurar que el cliente está satisfecho con la interfaz de usuario",
      "Gestionar los cambios a lo largo del ciclo de vida del software",
      "Reducir el tamaño del código fuente",
      "Eliminar la necesidad de pruebas manuales"
    ],
    "respuesta_correcta": "Gestionar los cambios a lo largo del ciclo de vida del software"
  },

  {
    "pregunta": "¿Qué técnica se basa en descomponer el proceso de desarrollo en actividades y estimar el esfuerzo necesario para cada una?",
    "opciones": [
      "Estimación por Puntos de Función",
      "Estimación basada en el proceso",
      "Estimación paramétrica",
      "Técnica LDC"
    ],
    "respuesta_correcta": "Estimación basada en el proceso"
  },

  {
    "pregunta": "¿Qué significa el proceso de post-desarrollo en ingeniería de software?",
    "opciones": [
      "La fase de diseño y desarrollo",
      "Las actividades realizadas después de la construcción del software, como instalación, operación, mantenimiento y retiro",
      "El proceso de pruebas",
      "La creación de documentación técnica"
    ],
    "respuesta_correcta": "Las actividades realizadas después de la construcción del software, como instalación, operación, mantenimiento y retiro"
  },

  {
    "pregunta": "¿Cuál es la importancia de la 'maduración del producto y del proceso' en la planificación de proyectos de software?",
    "opciones": [
      "Representa el inicio de la codificación",
      "Permite establecer actividades estructurales como comunicación con el cliente, análisis de riesgos y entrega del proyecto",
      "Sirve para medir la productividad del equipo",
      "Es un proceso usado solo en la fase de mantenimiento"
    ],
    "respuesta_correcta": "Permite establecer actividades estructurales como comunicación con el cliente, análisis de riesgos y entrega del proyecto"
  },

  {
    "pregunta": "¿Qué modelo de ciclo de vida permite un desarrollo más flexible y adaptable a cambios en los requisitos?",
    "opciones": [
      "Modelo en cascada",
      "Modelo iterativo",
      "Modelo en V",
      "Modelo incremental"
    ],
    "respuesta_correcta": "Modelo iterativo"
  },

  {
    "pregunta": "",
    "opciones": [""],
    "respuesta_correcta": ""
  }
]
